## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                   NAME                                                   |
|--------|----------------------------------------------------------------------------------------------------------|
| add    | `aws_identitystore_group.forms_production_billing_read_only`                                             |
|        | `aws_identitystore_group.forms_staging_billing_read_only`                                                |
|        | `aws_ssoadmin_account_assignment.forms_production[&quot;Forms-Production-Billing-ReadOnly-Billing-ReadOnly&quot;]` |
|        | `aws_ssoadmin_account_assignment.forms_staging[&quot;Forms-Staging-Billing-ReadOnly-Billing-ReadOnly&quot;]`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_identitystore_group.forms_production_billing_read_only will be created
  + resource "aws_identitystore_group" "forms_production_billing_read_only" {
      + description       = "Grants members read-only Billing and Cost Explorer access to the Forms Production account."
      + display_name      = "Forms-Production-Billing-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.forms_staging_billing_read_only will be created
  + resource "aws_identitystore_group" "forms_staging_billing_read_only" {
      + description       = "Grants members read-only Billing and Cost Explorer access to the Forms Staging account."
      + display_name      = "Forms-Staging-Billing-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_ssoadmin_account_assignment.forms_production["Forms-Production-Billing-ReadOnly-Billing-ReadOnly"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-155a8dac774b6771"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "957818836222"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.forms_staging["Forms-Staging-Billing-ReadOnly-Billing-ReadOnly"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-155a8dac774b6771"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "687401027353"
      + target_type        = "AWS_ACCOUNT"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_pinpoint_sms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_route53_notify_hosted_zone"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_s3_website_assets"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_support_center"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.athena_query_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.canadian_digital_service_production_website_admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.notify_access_ecs_blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.rds_query_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.read_only_billing"]

29 tests, 19 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
